{
  "backend/main.mo": "Motoko canister defining user profiles, cases, tasks, activity logs, and evidence with authorization checks and storage maps; includes CRUD-like logic and permission validation.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs for authentication, authorization gating, and onboarding flows.",
  "frontend-file-summaries.txt": "List of short summaries for all major frontend components, pages, hooks, and UI elements in the project.",
  "frontend/android-twa/.gitignore": "Git ignore rules for Android TWA build artifacts, keystores, Bubblewrap output, and IDE files.",
  "frontend/android-twa/keystore/.gitkeep": "Placeholder file to keep the keystore directory in version control.",
  "frontend/android-twa/README.md": "Documentation explaining how the Android TWA packaging works and how it syncs with PWA metadata.",
  "frontend/android-twa/twa-manifest.json": "TWA configuration defining app metadata, icons, colors, signing key, and Android build parameters.",
  "frontend/docs/android-apk-build.md": "Guide describing how to build the Android APK using Trusted Web Activity with prerequisites and steps.",
  "frontend/index.css": "Tailwind CSS base definitions and theme variables for light and dark modes.",
  "frontend/index.html": "Main HTML entry point setting PWA metadata, manifest, icons, and mounting the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theme colors, start URL, and display mode.",
  "frontend/public/sw.js": "Simple service worker implementing install, cache, fetch, and activate for offline caching.",
  "frontend/scripts/sync-android-twa-from-pwa.ts": "Node script that syncs TWA manifest fields with the PWA manifest and writes updated values.",
  "frontend/src/App.tsx": "Sets up the root React app with theme, auth gate, app shell, and defines all TanStack Router routes for pages before rendering the RouterProvider.",
  "frontend/src/components/accused/AccusedAttachmentUploadDialog.tsx": "Provides a dialog for adding an investigation record to an accused, including optional file upload with progress tracking.",
  "frontend/src/components/accused/AccusedFiltersBar.tsx": "Renders search and filter controls for accused records, including name, FIR, police station, and status, with a clear button.",
  "frontend/src/components/accused/AccusedFormDialog.tsx": "Form dialog for creating or editing an accused record with fields for personal, FIR, seizure, and status details.",
  "frontend/src/components/accused/AccusedInvestigationRecords.tsx": "Displays accused details and their investigation records, with an option to upload new records through a dialog.",
  "frontend/src/components/accused/AccusedList.tsx": "Shows a grid of accused records with status badges, FIR details, and actions to view details or edit a record.",
  "frontend/src/components/activity/ActivityLogForm.tsx": "Form dialog for logging officer activities, validating inputs and submitting via useLogOfficerActivity.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access-denied message with principal ID copy and logout actions.",
  "frontend/src/components/auth/AdminOnly.tsx": "Guards child content, showing an access-denied card if the caller is not an admin.",
  "frontend/src/components/auth/AuthGate.tsx": "Main authentication and authorization wrapper handling login flow, permission checks, and profile setup.",
  "frontend/src/components/auth/LoginButton.tsx": "Toggles login/logout using Internet Identity, clearing cache on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for creating a user profile with validation and error handling via useSaveCallerUserProfile.",
  "frontend/src/components/cases/CaseForm.tsx": "Form dialog to create a new investigation case, submitting data through useCreateCase.",
  "frontend/src/components/data/LastUpdatedBadge.tsx": "Shows a small badge indicating how long ago data was updated or loading/error states.",
  "frontend/src/components/data/ManualRefreshButton.tsx": "Button that triggers a manual refresh and shows a spinning icon when active.",
  "frontend/src/components/evidence/EvidenceForm.tsx": "Form dialog for adding evidence to a case, validating inputs and submitting via useAddEvidence.",
  "frontend/src/components/layout/AppShell.tsx": "Main app layout with header, navigation, user menu, and logout handling.",
  "frontend/src/components/layout/MobileNav.tsx": "Mobile bottom navigation with primary, more, reference, and admin links.",
  "frontend/src/components/tasks/TaskForm.tsx": "Form dialog for creating a new task, selecting a case and submitting via useCreateTask.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity authentication, exposing login, clear, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for interacting with backend actor methods for user profiles, roles, cases, and other domain data.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light/dark themes and mobile layout behavior.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AccusedInformationPage.tsx": "Displays accused records with filtering, searching, status tabs, and a form to add new accused entries.",
  "frontend/src/pages/ActivityLogsPage.tsx": "Shows officer activity logs with date filtering, manual refresh, sorting, and activity creation.",
  "frontend/src/pages/AdminRoleManagementPage.tsx": "Admin-only interface for assigning user roles by principal ID with validation and feedback.",
  "frontend/src/pages/antf-reference/LawsPage.tsx": "Displays NDPS Act overview and key legal sections using cards and scrollable layout.",
  "frontend/src/pages/antf-reference/ModulesPage.tsx": "Shows operational modules with objectives and activities for intelligence, enforcement, and investigation workflows.",
  "frontend/src/pages/antf-reference/NdpsSubstancesQuantityPage.tsx": "Lists NDPS substances with small/commercial quantity thresholds and explains related punishment categories.",
  "frontend/src/pages/antf-reference/ProceduresPage.tsx": "Outlines detailed SOPs for search, seizure, and arrest procedures in ANTF operations.",
  "frontend/src/pages/AntfStructurePage.tsx": "Static page displaying the ANTF organizational hierarchy and jurisdiction with structured text and sections.",
  "frontend/src/pages/CaseDetailPage.tsx": "Displays detailed case info, tasks, evidence, and allows admins to update case status.",
  "frontend/src/pages/CasesListPage.tsx": "Shows a filterable list of cases with status badges and a button to create new cases.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard aggregating counts of cases, tasks, logs, and evidence with quick refresh controls.",
  "frontend/src/pages/EvidencePage.tsx": "Lists evidence items with status indicators and supports adding new evidence.",
  "frontend/src/pages/TasksPage.tsx": "Displays and filters investigation tasks and provides a form to create new tasks.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker, logs status, and detects updates on load.",
  "frontend/src/utils/authErrors.ts": "Provides utilities to detect authorization-related backend errors and generate user-facing unauthorized messages.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with session persistence support.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended theme settings, custom colors, animations, and plugins.",
  "project_state.json": "Stores project metadata, existing features, and new feature requests for the Narcotics Duty Desk app."
}