{
  "backend/main.mo": "Defines user profiles, cases, tasks, activity logs, and evidence types with access-controlled CRUD operations and storage mixins.",
  "feature_evidence.json": "Lists evidence-related feature requirements, associated files, components, and test IDs for build planning.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all major frontend files including pages, components, and hooks.",
  "frontend/index.css": "Sets Tailwind base styles and color variables for light and dark themes using OKLCH values.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router, theme provider, auth gate, AppShell layout, and all application routes.",
  "frontend/src/components/accused/AccusedAttachmentUploadDialog.tsx": "Dialog for adding an accused investigation record with file upload handling, size validation, and progress tracking.",
  "frontend/src/components/accused/AccusedFiltersBar.tsx": "Provides search and filter inputs for accused records, including name, FIR, police station, and status, with a clear-filters option.",
  "frontend/src/components/accused/AccusedFormDialog.tsx": "Modal form for creating or editing an accused record, handling validation and submitting mutations.",
  "frontend/src/components/accused/AccusedInvestigationRecords.tsx": "Displays detailed accused information and investigation records, with an option to upload new attachments.",
  "frontend/src/components/accused/AccusedList.tsx": "Renders a grid of accused records with status badges, edit and detail view dialogs.",
  "frontend/src/components/activity/ActivityLogForm.tsx": "Dialog form for logging an officer activity with type selection and description submission.",
  "frontend/src/components/auth/AdminOnly.tsx": "Restricts content to admin users, showing a permission error if access is denied.",
  "frontend/src/components/auth/AuthGate.tsx": "Handles authentication flow, showing login, profile setup, or gated content based on user state.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button that logs users in or out using Internet Identity and resets cached queries on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal form that collects officer profile details and saves them using useSaveCallerUserProfile with validation and toast feedback.",
  "frontend/src/components/cases/CaseForm.tsx": "Dialog form for creating a new case, validating inputs and submitting via useCreateCase with identity-based investigator assignment.",
  "frontend/src/components/data/LastUpdatedBadge.tsx": "Badge component that displays last-updated time or loading/error states based on props.",
  "frontend/src/components/data/ManualRefreshButton.tsx": "Small button that triggers manual data refresh and shows a spinning icon while refreshing.",
  "frontend/src/components/evidence/EvidenceForm.tsx": "Form for adding evidence to a selected case, supporting type selection and submitting via useAddEvidence.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout with navigation, header, user menu, and admin-aware links wrapping child content.",
  "frontend/src/components/tasks/TaskForm.tsx": "Dialog form for creating tasks linked to a case, assigning the current user and submitting via useCreateTask.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication and login state using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as user profiles, roles, cases, and related records via an actor.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines CSS variables for light and dark mode color themes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccusedInformationPage.tsx": "Displays and filters accused records with tabs, search inputs, and a form for creating new entries.",
  "frontend/src/pages/ActivityLogsPage.tsx": "Shows officer activity logs with date filtering, manual refresh, and a form to add new logs.",
  "frontend/src/pages/AdminRoleManagementPage.tsx": "Admin-only UI for assigning user roles by principal ID with form validation and backend mutation.",
  "frontend/src/pages/antf-reference/LawsPage.tsx": "Renders a page describing NDPS Act provisions with cards outlining key sections and legal details.",
  "frontend/src/pages/antf-reference/ModulesPage.tsx": "Displays operational modules such as intelligence gathering, enforcement, and investigation with objectives and activities.",
  "frontend/src/pages/antf-reference/NdpsSubstancesQuantityPage.tsx": "Shows classification rules and a table of small and commercial quantities for various NDPS substances.",
  "frontend/src/pages/antf-reference/ProceduresPage.tsx": "Provides detailed SOPs for search, seizure, and arrest processes under ANTF operations.",
  "frontend/src/pages/AntfStructurePage.tsx": "Displays ANTF organizational structure and jurisdiction using cards and descriptive text.",
  "frontend/src/pages/CaseDetailPage.tsx": "Shows detailed case info with status updates, related tasks, logs, and evidence.",
  "frontend/src/pages/CasesListPage.tsx": "Lists all cases with filtering, creation, and navigation to case details.",
  "frontend/src/pages/DashboardPage.tsx": "Provides an overview of cases, tasks, logs, and evidence with quick stats.",
  "frontend/src/pages/EvidencePage.tsx": "Displays evidence items with statuses, case links, and form for adding new evidence.",
  "frontend/src/pages/TasksPage.tsx": "Lists investigation tasks with filtering, status badges, and task creation.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters, including hash parsing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins for typography, queries, and animations.",
  "project_state.json": "Defines project metadata and feature requirements for updating ANTF organizational structure documentation, including hierarchy, roles, staffing, and terminology corrections."
}