{
  "kind": "build_request",
  "title": "Add a simple Internet Identity login and authorization gate",
  "projectName": "Narcotics Duty Desk",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the app has a complete, user-friendly login screen and authentication flow using Internet Identity, including clear login/logout states and a loading/initialization state before the app shell renders.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "When the user is not authenticated, the app shows a dedicated login screen (not the main AppShell) with a Login button.",
        "While Internet Identity is initializing, the app shows an initialization/loading state.",
        "When the user is authenticated, the main app routes render normally.",
        "The user can logout, and the app returns to the login screen and clears cached queries (no authenticated data remains visible)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add an authorization-aware gate after Internet Identity login so that users who are authenticated but do not yet have required backend permissions do not see broken pages; instead, show an 'Access Denied / Not Authorized' screen that includes the user’s Principal ID and clear instructions to contact an admin for role assignment.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "If backend queries fail due to Unauthorized errors after login (e.g., profile/role checks), the app shows a friendly access-denied screen rather than rendering the main pages with failing queries.",
        "The access-denied screen displays the logged-in Principal ID in a copyable form.",
        "The access-denied screen instructs the user to contact an administrator to assign a role (e.g., User/Admin) via the existing Role Management flow.",
        "The user can logout from the access-denied screen."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Adjust the post-login onboarding so that profile setup is only shown when the authenticated user is authorized and the backend indicates the profile is missing (null), and show a clear error message if profile creation fails due to authorization or other backend errors.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "ProfileSetupModal is only shown when the user is authenticated, authorized, and getCallerUserProfile returns null (missing profile).",
        "If saving the profile fails with an Unauthorized error, the UI shows a specific, user-friendly message indicating the user is not authorized and needs an admin role assignment.",
        "If saving the profile fails for other reasons, the UI shows a user-friendly error and does not dismiss the modal."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn components must be composed, not modified).",
    "Do not modify immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Implementing real-time communication features (WebSockets/chat).",
    "Adding external databases or non-Motoko backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}