{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Internet Identity login flow with authorization gate and safe profile onboarding",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Provide a dedicated Internet Identity login screen with clear init/loading, authenticated app rendering, and robust logout cache clearing.",
      "acceptanceCriteria": [
        "When the user is not authenticated, the app shows a dedicated login screen (not the main AppShell) with a Login button.",
        "While Internet Identity is initializing, the app shows an initialization/loading state.",
        "When the user is authenticated, the main app routes render normally.",
        "The user can logout, and the app returns to the login screen and clears cached queries (no authenticated data remains visible)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/AuthGate.tsx",
          "operation": "modify",
          "description": "Update the auth gate to ensure the app shell/routes only render after Internet Identity is initialized and the user is authenticated; keep the dedicated login screen for unauthenticated users. Use the selected \"authorization\" component’s frontend guidance for Internet Identity + cache clearing behavior (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/components/auth/LoginButton.tsx",
          "operation": "modify",
          "description": "Ensure logout consistently clears all cached React Query data and returns the UI to the dedicated login screen; keep clear login/logout states. Use the selected \"authorization\" component’s frontend guidance for logout cache clearing (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Confirm logout from the user menu clears cached queries and drops identity so the app returns to the login screen with no authenticated data visible; keep behavior aligned with the selected \"authorization\" component guidance (Verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add an authorization-aware post-login gate that shows an Access Denied screen (with Principal ID + instructions) when backend authorization checks fail.",
      "acceptanceCriteria": [
        "If backend queries fail due to Unauthorized errors after login (e.g., profile/role checks), the app shows a friendly access-denied screen rather than rendering the main pages with failing queries.",
        "The access-denied screen displays the logged-in Principal ID in a copyable form.",
        "The access-denied screen instructs the user to contact an administrator to assign a role (e.g., User/Admin) via the existing Role Management flow.",
        "The user can logout from the access-denied screen."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/AccessDeniedScreen.tsx",
          "operation": "create",
          "description": "Create an AccessDeniedScreen component shown for authenticated-but-unauthorized users; display the current user Principal ID (copyable) and clear instructions to contact an admin for role assignment via the existing Role Management flow; include a Logout action. Use the selected \"authorization\" component’s Access Control UI guidance (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/components/auth/AuthGate.tsx",
          "operation": "modify",
          "description": "Add an authorization-aware gate after login: perform role/profile permission checks and detect Unauthorized-like backend errors; if unauthorized, render AccessDeniedScreen instead of AppShell/routes so users never see broken pages. Use the selected \"authorization\" component guidance for handling authorization traps gracefully (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden role/admin/profile-related queries used by the gate to avoid retry loops and to surface authorization failures predictably to the UI (e.g., disable retries for authorization checks and expose error state cleanly). Use the selected \"authorization\" component guidance for graceful handling of authorization traps (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/utils/authErrors.ts",
          "operation": "create",
          "description": "Add a small helper to classify backend/agent errors as Unauthorized (string matching on common trap/error messages) so AuthGate/ProfileSetup can show the correct Access Denied or user-friendly messages. Use this helper in the auth flow; align with the selected \"authorization\" component guidance on handling authorization errors (Verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure profile onboarding only appears for authorized users with missing profile, and show specific save-failure messages (Unauthorized vs other errors).",
      "acceptanceCriteria": [
        "ProfileSetupModal is only shown when the user is authenticated, authorized, and getCallerUserProfile returns null (missing profile).",
        "If saving the profile fails with an Unauthorized error, the UI shows a specific, user-friendly message indicating the user is not authorized and needs an admin role assignment.",
        "If saving the profile fails for other reasons, the UI shows a user-friendly error and does not dismiss the modal."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/AuthGate.tsx",
          "operation": "modify",
          "description": "Adjust the post-login onboarding decision so ProfileSetupModal only renders when the user is authenticated, authorized (role/permission check passes), and the profile query is fetched and returns null; if authorization checks fail, show AccessDeniedScreen instead. Use the selected \"authorization\" component’s \"Preventing Profile Setup Modal Flash\" guidance (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/components/auth/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Improve profile save error handling: if the mutation fails due to Unauthorized, show a specific message instructing the user to contact an admin for role assignment; otherwise show a generic friendly error and keep the modal open. Use the shared Unauthorized classification helper; align with selected \"authorization\" component guidance on authorization trap errors (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/utils/authErrors.ts",
          "operation": "modify",
          "description": "Extend/confirm Unauthorized detection to cover both read (getCallerUserProfile/getCallerUserRole) and write (saveCallerUserProfile) failures so UI can distinguish Unauthorized from other errors. Keep aligned with selected \"authorization\" component guidance (Verify the component's usage instructions before implementing)."
        }
      ]
    }
  ]
}